{
  "document": {
    "title": "My Portfolio"
  },
  "navbar": {
    "home": "Home",
    "about": "About",
    "resume": "Resume",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "title": "I'm Victor Ccanchi",
    "subtitle": "Hello, World!",
    "description": "Web developer | Frontend especialist",
    "button": "More about me"
  },
  "about": {
    "title": "About",
    "subtitle": "Let me introduce myself",
    "description": "Hi!, I'm Victor , a passionate web developer from Lima, Peru. My focus is creating digital solutions, offering products that are functional, scalable, and visually appealing. My main goal is transforming ideas into real projects through the use of modern technologies.",
    "profile": {
      "title": "Profile",
      "description": "I am a web developer with a focus on frontend technologies. I enjoy creating user-friendly interfaces and ensuring a smooth user experience. My expertise includes HTML, CSS, JavaScript, and various frameworks.",
      "fullname-title": "Fullname",
      "fullname": "Victor Ccanchi",
      "job-title": "Job",
      "job": "Web Developer",
      "location-title": "Location",
      "location": "Lima, Peru",
      "email-title": "Email",
      "email": "victorwccv@gmail.com",
      "linkedin-title": "LinkedIn",
      "linkedin": "victor-ccanchi",
      "github-title": "GitHub",
      "github": "victorwcv"
    },
    "skills": {
      "title": "Skills",
      "description": "Skilled in JavaScript, TypeScript, React, Vue.js, Lit, Node.js, Express, MongoDB, Tailwind CSS, and more modern technologies & tools for web development.",
      "technologies-label": "Technologies",
      "tools-label": "Tools",
      "others-label": "Others"
    },
    "hire-me-button": "Hire me",
    "download-cv-button": "Download CV"
  },
  "resume": {
    "title": "Resume",
    "subtitle": "More About My Credentials",
    "description": "Discover my professional experience and academic background, reflecting my commitment and continuous growth in software development.",
    "experience": {
      "title": "Work Experience",
      "title-1": "Junior Software Engineer",
      "date-1": "Sept. 2024 - Present",
      "organization-1": "NTT Data",
      "description-1": "As a Junior Software Engineer, I have contributed to the development and maintenance of web applications for clients using React, Vue.js, and Angular. I specialize in building dynamic interfaces and reusable components, collaborating with cross-functional teams to integrate frontend solutions with backend systems.",
      "title-2": "AI Code Reviewer",
      "date-2": "Jun. 2024 - Aug. 2024",
      "organization-2": "Revelo",
      "description-2": "Reviewed and evaluated AI-generated code, providing actionable feedback to enhance its accuracy and effectiveness. Identified and reported proper and improper tool usage, contributing to the improvement of AI models. Additionally, collaborated with teams to implement recommendations, increasing the quality and relevance of the generated code.",
      "title-3": "Freelance Developer",
      "date-3": "Jan. 2024 - Aug. 2024",
      "organization-3": "Self-employed",
      "description-3": "Designed and implemented custom web solutions tailored to client needs, utilizing modern technologies such as React, Node.js, and MongoDB. Responsibilities included developing user-friendly interfaces, optimizing application performance, and ensuring seamless integration between frontend and backend."
    },
    "education": {
      "title": "Education",
      "title-1": "Professional Certificate in Full Stack Web Development",
      "date-1": "Sept. 2023 - Aug. 2024",
      "organization-1": "Massachusetts Institute of Technology - xPro",
      "description-1": "Completed an intensive program focused on modern full-stack web development. Gained expertise in technologies such as React, Node.js, Express, and MongoDB, developing practical skills to build scalable and responsive web applications. The program emphasized hands-on projects, collaborative coding, and software engineering best practices.",
      "title-2": "Coursework in Electronic Engineering",
      "date-2": "Jan. 2020 - Jul. 2023",
      "organization-2": "San Luis Gonzaga University",
      "description-2": "Completed foundational coursework in electronic systems, circuit design, and programming, acquiring a strong technical foundation in problem-solving and analytical thinking. Gained experience applying engineering principles to design and optimize electronic components while developing teamwork and project-based learning skills.",
      "title-3": "Technical Diploma in Industrial Electricity",
      "date-3": "Aug. 2012 - Jul. 2015",
      "organization-3": "SENATI",
      "description-3": "Although my background is in industrial electricity, my studies provided a solid foundation in technical problem-solving, analytical thinking, and project management. These skills have been essential in my transition to software development, where I apply similar logical reasoning and troubleshooting techniques to build and optimize software solutions."
    },
    "certificates": {
      "title": "Certificates",
      "description": "I have earned several certifications that validate my skills and knowledge in web development and software engineering, demonstrating my commitment to continuous learning and professional growth."
    }
  },
  "stats": {
    "years-experience": "Years of Experience",
    "certificates": "Certificates",
    "projects-completed": "Projects Completed",
    "coffee-cups": "Coffee Cups",
    "code-commits": "Code Commits",
    "code-hours": "Code Hours"
  }
}