{
  "document": {
    "title": "Mi Portafolio"
  },
  "navbar": {
    "home": "Inicio",
    "about": "Sobre mi",
    "resume": "Currículum",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "home": {
    "title": "Soy Victor Ccanchi",
    "subtitle": "Hola, Mundo!",
    "description": "Desarrollador web | Especialista frontend",
    "button": "Más sobre mí"
  },
  "about": {
    "title": "Sobre mi",
    "subtitle": "Déjame presentarme",
    "description": "¡Hola!, soy Victor, un apasionado desarrollador web de Lima, Perú. Me enfoco en crear soluciones digitales, ofreciendo productos que son funcionales, escalables y visualmente atractivos. Mi principal objetivo es transformar ideas en proyectos reales mediante el uso de tecnologías modernas.",
    "profile": {
      "title": "Perfil",
      "description": "Soy un desarrollador web con enfoque en tecnologías frontend. Disfruto creando interfaces amigables y asegurando una experiencia de usuario fluida. Mis habilidades incluyen HTML, CSS, JavaScript y varios frameworks.",
      "fullname-title": "Nombre completo",
      "fullname": "Victor William Ccanchi Vasquez",
      "job-title": "Profesión",
      "job": "Desarrollador Web, Frontend",
      "location-title": "Ubicación",
      "location": "Lima, Perú",
      "email-title": "Correo electrónico",
      "email": "victorwccv@gmail.com",
      "linkedin-title": "LinkedIn",
      "linkedin": "victor-ccanchi",
      "github-title": "GitHub",
      "github": "victorwcv"
    },

    "skills": {
      "title": "Habilidades",
      "description": "Conocimiento en JavaScript, TypeScript, React, Vue.js, Lit, Node.js, Express, MongoDB, Tailwind CSS y otras tecnologías y herramientas modernas para el desarrollo web.",
      "technologies-label": "Tecnologías",
      "tools-label": "Herramientas",
      "others-label": "Otros"
    },
    "hire-me-button": "Contáctame",
    "download-cv-button": "Descargar CV"
  },
  "resume": {
    "title": "Currículum",
    "subtitle": "Más sobre mis credenciales",
    "description": "Conoce mi experiencia profesional y formación académica, que reflejan mi compromiso y crecimiento constante en el desarrollo de software.",
    "experience": {
      "title": "Experiencia Laboral",
      "title-1": "Ingeniero de Software Junior",
      "date-1": "Sept. 2024 - Presente",
      "organization-1": "NTT Data",
      "description-1": "En mi rol como Ingeniero de Software Junior, he participado en el desarrollo y mantenimiento de aplicaciones web para clientes, utilizando React, Vue.js y Angular. Me especializo en la creación de interfaces dinámicas y componentes reutilizables, colaborando con equipos multidisciplinarios para integrar soluciones frontend con sistemas backend.",
      "title-2": "Revisor de Código Generado por IA",
      "date-2": "Jun. 2024 - Ago. 2024",
      "organization-2": "Revelo",
      "description-2": "Revisé y evalué código generado por IA, brindando retroalimentación para optimizar su precisión y efectividad. Identifiqué y reporté usos correctos e incorrectos de la herramienta, contribuyendo a la mejora de los modelos de IA. Además, colaboré con equipos para implementar recomendaciones que aumentaron la calidad y relevancia del código generado.",
      "title-3": "Desarrollador Freelance",
      "date-3": "Ene. 2024 - Ago. 2024",
      "organization-3": "Autónomo",
      "description-3": "Diseñé e implementé soluciones web personalizadas para clientes, utilizando tecnologías modernas como React, Node.js y MongoDB. Mis responsabilidades incluyeron desarrollar interfaces intuitivas, optimizar el rendimiento de las aplicaciones y garantizar una integración fluida entre frontend y backend."
    },
    "education": {
      "title": "Educación",
      "title-1": "Certificado Profesional en Desarrollo Web Full Stack",
      "date-1": "Sept. 2023 - Ago. 2024",
      "organization-1": "Massachusetts Institute of Technology - xPro",
      "description-1": "Completé un programa intensivo enfocado en el desarrollo web full stack moderno. Adquirí experiencia en tecnologías como React, Node.js, Express y MongoDB, desarrollando habilidades prácticas para crear aplicaciones web escalables y responsivas. El programa enfatizó proyectos prácticos, trabajo colaborativo y buenas prácticas de ingeniería de software.",
      "title-2": "Estudios en Ingeniería Electrónica",
      "date-2": "Ene. 2020 - Jul. 2023",
      "organization-2": "Universidad Nacional San Luis Gonzaga",
      "description-2": "Completé cursos fundamentales en sistemas electrónicos, diseño de circuitos y programación, obteniendo una base técnica sólida en resolución de problemas y pensamiento analítico. Gané experiencia aplicando principios de ingeniería para diseñar y optimizar componentes electrónicos, desarrollando habilidades de trabajo en equipo y aprendizaje basado en proyectos.",
      "title-3": "Técnico en Electricidad Industrial",
      "date-3": "Ago. 2012 - Jul. 2015",
      "organization-3": "SENATI",
      "description-3": "Aunque mi formación inicial fue en electricidad industrial, me proporcionó una base sólida en resolución técnica de problemas, pensamiento analítico y gestión de proyectos. Estas habilidades han sido esenciales para mi transición al desarrollo de software, aplicando el mismo razonamiento lógico y técnicas de diagnóstico para construir y optimizar soluciones digitales."
    },
    "certificates": {
      "title": "Certificaciones",
      "description": "He obtenido diversas certificaciones que validan mis habilidades y conocimientos en desarrollo web e ingeniería de software, demostrando mi compromiso con el aprendizaje continuo y el crecimiento profesional."
    }
  },
  "stats": {
    "years-experience": "Años de experiencia",
    "certificates": "Certificados obtenidos",
    "projects-completed": "Proyectos Completados",
    "coffee-cups": "Tazas de café tomadas",
    "code-commits": "Commits realizados",
    "code-hours": "Horas codificando"
  },
  "contact": {
    "title": "CONTACTO",
    "subtitle": "Me encantaría saber de ti.",
    "description": "No dudes en ponerte en contacto conmigo para colaborar, hacer preguntas u ofrecer oportunidades—¡siempre estoy abierto a conectar!",
    "alert": {
      "success": "Mensaje enviado con éxito",
      "error": "Error al enviar el mensaje"
    },
    "form": {
      "name": "Nombre",
      "email": "Correo electrónico",
      "message": "Mensaje",
      "errors": {
        "required": "este campo es obligatorio",
        "invalidEmail": "formato de correo inválido"
      },
      "submit": "Enviar",
      "submitting": "Enviando..."
    }
  },
  "footer": {
    "copyright": "Copyright {{year}}",
    "developedBy": "Desarrollado por",
    "poweredBy": "Impulsado por",
    "author": "Victor Ccanchi",
    "stack": "React + TypeScript"
  }
}
